WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetUnsignedLong_Client_Request-4.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetUnsignedLong</a:Action>
    <a:MessageID>urn:uuid:70fbd59f-3c7d-4f2e-98c6-f9e645f2eae8</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetUnsignedLong xmlns="http://tempuri.org/">
      <inULong xmlns="">50</inULong>
    </RetUnsignedLong>
  </s:Body>
</s:Envelope>